kernel/interrupts/interrupts.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2020-12-21 Mon 21:36 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>中断与异常</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">中断与异常</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org370de87">1. 中断信号的作用</a></li>
<li><a href="#orge94ed35">2. 中断、异常对比</a></li>
<li><a href="#org328874b">3. IRQ与中断</a>
<ul>
<li><a href="#org0cdbcfe">3.1. 高级可编程中断控制器（APIC）</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
本文讲述Linux的中断和异常。
</p>

<p>
中断通常定义为可以修改指令流的事件。这些事件都对应着电信号，电信号的可以来自CPU芯片内部或外部。
</p>

<p>
中断通常可以划分为两类，同步与异步，所谓同/异步：
</p>
<ul class="org-ul">
<li>同步中断：
<ol class="org-ol">
<li>由CPU控制单元发出。</li>
<li>在指令执行结束时调用。</li>
</ol></li>
<li>异步中断：
<ol class="org-ol">
<li>由其它硬件生成。</li>
<li>相对于CPU的时钟来说，其发生时机是任意的。</li>
</ol></li>
</ul>

<p>
中断由CPU内部定时器或I/O设备发出，比如用户敲击键盘就会产生中断。
</p>

<p>
异常就是由程序异常或其它异常条件发生时产生。前一种情况，内核发送信号给产生异常的进程。而后一种比如有Page faule或经由int(sysenter)指令来请求内核服务，这时内核会执行 <b>一系列步骤</b> 然后从 <b>异常中恢复</b> 。
</p>

<div id="outline-container-org370de87" class="outline-2">
<h2 id="org370de87"><span class="section-number-2">1</span> 中断信号的作用</h2>
<div class="outline-text-2" id="text-1">
<p>
中断信号提供了一种能力，它可以使得CPU转移(divert)出正常的指令执行流。中断信号到来时，CPU必
须停下它正在做的事情并切换到新的代码路径上。这通过以下两点做到：
</p>
<ol class="org-ol">
<li>把当前的程序计数器（PC，program counter）存到内核态栈上（Kernel Mode stack）。</li>
<li>放置与引起中断相关的服务例程到PC里。</li>
</ol>

<p>
这些文字可能会让我们联想到进程切换，不过中断处理和进程切换是完全不同的：
</p>
<ol class="org-ol">
<li>执行中断/异常的代码可不是进程的代码。</li>
<li>它是一种控制路径（control path），当中断发生时，代表进程执行。</li>
<li>这种control path比起进程，它更加轻量，具有更少的上下文和处理时间。</li>
</ol>
</div>
</div>

<div id="outline-container-orge94ed35" class="outline-2">
<h2 id="orge94ed35"><span class="section-number-2">2</span> 中断、异常对比</h2>
<div class="outline-text-2" id="text-2">
<p>
英特尔文档对中断和异常做如下的归类：
</p>
<ol class="org-ol">
<li>中断：
<ol class="org-ol">
<li><p>
可屏蔽中断
</p>

<p>
由I/O设备发出的中断都是可屏蔽的，可屏蔽中断有两种状态，屏蔽或非屏蔽，屏蔽了的中断会被CPU忽略。
</p></li>
<li><p>
不可屏蔽中断
</p>

<p>
一些很关键的事件（比如硬件错误）是不能屏蔽的，这些中断一定会被CPU识别。
</p></li>
</ol></li>
<li><p>
异常：
</p>
<ol class="org-ol">
<li><p>
处理器可检测异常
</p>

<p>
在CPU执行指令的时候检测到的异常，其可分为三类。
</p>
<ol class="org-ol">
<li><p>
Faults
</p>

<p>
这种类型的异常通常是可以被纠正的，eip寄存器存的就是当前引起Faults的指令。当相应的异常句柄执行完毕后，就会由eip指令处继续执行。比如page fault就有对应的异常句柄，就
是此类的。 <b>这里eip存的是引起Faults的指令，等到异常句柄执行完毕返回时，也会从这条指令开始执行。</b>
</p></li>
<li><p>
Traps
</p>

<p>
<b>eip存放的是引起Traps指令的后一条指令。</b> Traps异常的情况不会再一次执行引起Traps的指令，这主要用于debugger，这里主要通知debugger一个特别的指令被执行了（比如breakpoint断点指令）。
</p></li>
<li><p>
Aborts
</p>

<p>
发生了一个严重的错误，有可能引起异常的指令都不能存在eip寄存器中，这些严重的错误比如有硬件错误或者系统的表等数据处于不一致或无效状态，相应的异常处理句柄只能中止相关进程。
</p></li>
</ol></li>

<li><p>
程序异常
</p>

<p>
依程序员的请求而发生的异常，比如由int或int3指令引起，通常是作为traps来处理。这种异常有两种常见的用途：实现系统调用或通知调试器一个特别的事件发生了。
</p></li>
</ol>

<p>
中断或异常由一个0-255范围的数字来标识，Intel将这个8-bit的数字叫做向量。不可屏蔽中断的号码是固定的，而可屏蔽中断的数字是可以通过编程中断控制器来改变的。
</p></li>
</ol>
</div>
</div>
<div id="outline-container-org328874b" class="outline-2">
<h2 id="org328874b"><span class="section-number-2">3</span> IRQ与中断</h2>
<div class="outline-text-2" id="text-3">
<p>
每一个可以发出中断的硬件（控制器）都有一个与之关联的输出线：Interrupt ReQuest(IRQ)线。所有
的IRQ线又连接到中断控制器（一种电路）的输入管脚中，这个中断控制器会执行如下动作：
</p>
<ol class="org-ol">
<li>监控所有的IRQ，检查是否中断信号到来，如果有多个中断信号到来的话，就选择其中一个较小的号
码。</li>
<li>对于选中的IRQ：
<ol class="org-ol">
<li>将收到的信号转换为对应的向量。</li>
<li>将转换好的向量存到中断控制器的I/O端口，这样CPU就可以通过数据总线来读取了。</li>
<li>发送一个信号到CPU的INTR管脚，也即发起中断。</li>
<li>等待CPU确认中断，然后会写一个PIC（Programmable Interrupt Controllers）的端口，随后清除INTR线。</li>
</ol></li>
<li>回到第一步中重复执行。</li>
</ol>

<p>
IRQ号码通常是由0开始的连续序列号，所以第一个IRQ号码通常就是0。Intel默认的向量和IRQ线的对应关系是IRQn的向量为IRQn+32，这种映射关系是可以通过运行I/O指令修改中端控制器的port来改变的。
</p>

<p>
IRQ可以被disable，disable的IRQ，其实就是中断控制器在对应的IRQ线上不给CPU的INTR管脚发送信号，但是这并不意味着相关的中断信号就丢失了，只要IRQ被enable了，这些信号就会被再一次发送。
</p>

<p>
disable/enable IRQ都是针对某个具体的IRQ线，而对eflags寄存器的IF标志位进行操作则可以使得 <b>所有可屏蔽</b> 中断被忽略，cli和sti指令分别用来清除或设置这个标志。
</p>

<p>
传统的PIC以“级联”方式连接在一起，每个芯片都可以8个IRQ，但是从PIC的INT管脚和主PIC的IRQ2连在
一起，所以总的可用的IRQ线其实只有15条。
</p>
</div>
<div id="outline-container-org0cdbcfe" class="outline-3">
<h3 id="org0cdbcfe"><span class="section-number-3">3.1</span> 高级可编程中断控制器（APIC）</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2020-12-21 Mon 21:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
